#include <stdio.h>
unsigned long long int rdtsc(void);

//duża tablica znaków (każdy element to 1 B)
char* tab[1<<26];
unsigned long long int start, czas;

int main()
{
//iteratory
  int  j, z = 0;
  double potega = 0, i = 1;

//pomar czasu obejmuje wykonanie wszystkich obliczeń
 	    start = rdtsc();
	    
	    for(j = 0; j <= (1<<26); j++)
	    	{
   	    	tab[0] += (('4')/180)+987-155;
   	    	tab[j] += '7';
   	    	}
     	    czas = rdtsc() - start;

            printf("%lld\n", (czas/(2*(1<<26))));
            
//zakładam że 2 drożna            
            start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    	{
   	    	tab[0] += (('q')/100)+1557; 
   	    	tab[(0+262144)] += (('a')/100)+155;   
   	    	tab[j] += '1';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(3*(1<<26))));
  
  ///zakładam że 3 drożna
  
  	    start = rdtsc();
	    
	    for(j = 0; j <= (1<<26); j++)
	    	{
       	    	tab[0] += (('p')/120)+155; 
   	    	tab[0+262144] += (('y')/190)+175;    
   	    	tab[0+2*262144] += (('t')/200)+855; 
   	    	tab[j] -= 156;
   	    	}
     	    czas = rdtsc() - start;

            printf("   %lld\n", (czas/(4*(1<<26))));
            
//zakładam że 4 drożna            
            start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    	{
       	    	tab[0] += (('h')/100)+165; 
   	    	tab[0+262144] += (('a')/150)+135;    
   	    	tab[0+2*262144] += (('b')/160)+165; 
    	  	tab[0+3*262144] += (('i')/103)+195; 
    	  	tab[j] += 'a';
   	    	}
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(5*(1<<26))));
 
 //zakładam że 5 drożna
 
            start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
           	    	tab[0] += (('n')/150)-48955; 
   	    	tab[0+262144] += (('n')/170)+1465;    
   	    	tab[0+2*262144] += (('a')/170)+155; 
    	  	tab[0+3*262144] += (('n')/180)+4555;  
    	  	  	tab[0+4*262144] += (('n')/1780)+4565; 
    	  	  	tab[j] += '6';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(6*(1<<26))));

//ze 6 drożna
            start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
           	    	tab[0] += (('d')/104)+199; 
   	    	tab[0+262144] += (('r')/104)+178;    
   	    	tab[0+2*262144] += (('y')/150)+187; 
    	  	tab[0+3*262144] += (('i')/101)+165;  
  	  	tab[0+4*262144] += (('u')/103)+112;  
  	  	tab[0+5*262144] += (('k')/107)+156;  
  	  	  	tab[j] += 'u';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(7*(1<<26))));
            
//7 drożna                     

  start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
           	    	tab[0] += (('j')/108)+167; 
   	    	tab[0+262144] += (('l')/170)+155;    
   	    	tab[0+2*262144] += (('h')/110)+125; 
    	  	tab[0+3*262144] += (('l')/160)+1435;  
  	  	tab[0+4*262144] += (('c')/100)+1515;  
  	  	tab[0+5*262144] += (('7')/100)+155;  
  	  	tab[0+6*262144] += (('l')/106)+1435;
  	  	  	tab[j] += 'y';
   	    	}   
       	    czas = rdtsc() - start;
     	    
            printf("   %lld\n",(czas/(8*(1<<26))));
          

//drożna 8

  start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
        	    	tab[0] += (('t')/1010)+1525; 
   	    	tab[0+262144] += (('7')/1010)+1552;    
   	    	tab[0+2*262144] += (('1')/1020)+15521; 
    	  	tab[0+3*262144] += (('4')/1020)+15325;  
  	  	tab[0+4*262144] += (('5')/1001)+1455;  
  	  	tab[0+5*262144] += (('y')/1002)+1552;  
  	  	tab[0+6*262144] += (('d')/1002)+1545;  
   	  	tab[0+7*262144] += (('j')/1010)+1355; 
   	  	  	tab[j] += 'r';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(9*(1<<26))));
          
//wiem żę nie może być 9 drożna


	start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
        	    	tab[0] += (('k')/1001)+1355; 
   	    	tab[0+262144] += (('y')/1001)+1355;    
   	    	tab[0+2*262144] += (('v')/1002)+155; 
    	  	tab[0+3*262144] += (('a')/1003)+1455;  
  	  	tab[0+4*262144] += (('5')/1002)+1555;  
  	  	tab[0+5*262144] += (('3')/100)+1556;  
  	  	tab[0+6*262144] += (('`')/1003)+1575;  
   	  	tab[0+7*262144] += (('2')/100)+1558; 
   	  	tab[0+8*262144] += (('7')/10430)+1595; 
   	  	  	tab[j] += 'n';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n",(czas/(10*(1<<26))));
          
//wiem też że nie może być 10 drożna

start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
        	    	tab[0] += (('g')/100)+155; 
   	    	tab[0+262144] += (('%')/100)+155;    
   	    	tab[0+2*262144] += (('6')/100)+155; 
    	  	tab[0+3*262144] += (('t')/102340)+155;  
  	  	tab[0+4*262144] += (('h')/10042)+1155;  
  	  	tab[0+5*262144] += (('j')/10430)+1525;  
  	  	tab[0+6*262144] += (('k')/1004)+155;  
   	  	tab[0+7*262144] += (('s')/100432)+155; 
   	  	tab[0+8*262144] += (('q')/100)+155;  
	  	tab[0+9*262144] += (('x')/104320)+155;  
	  	  	tab[j] += '8';
   	    	} 
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n", (czas/(11*(1<<26))));
          

start = rdtsc();

	    for(j = 0; j <= (1<<26); j++)
	    {
        	    	tab[0] += (('z')/100)+155; 
   	    	tab[0+262144] += (('a')/100)+155;    
   	    	tab[0+2*262144] += (('x')/100)+155; 
    	  	tab[0+3*262144] += (('x')/100)+155;  
  	  	tab[0+4*262144] += (('x')/100)+155;  
  	  	tab[0+5*262144] += (('x')/100)+155;  
  	  	tab[0+6*262144] += (('x')/100)+155;  
   	  	tab[0+7*262144] += (('x')/100)+155; 
   	  	tab[0+8*262144] += (('x')/100)+155;  
	  	tab[0+9*262144] += (('x')/100)+155;    
	  	tab[0+10*262144] += (('x')/100)+155; 
	  	  	tab[j] += '1';
   	    	}  
     	    czas = rdtsc() - start;
     	    
            printf("   %lld\n",(czas/(12*(1<<26))));
          
         
   return 0;         
}


